// pages/category/trademark/trademark.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: ['01类 化工原料', '02类 颜料油漆', '03类 日化用品', '04类 燃料油脂', '05类 医药', '06类 金属材料', '07类 机械设备', '08类 手工器械', '09类 科学仪器', '10类 医疗器械', '11类 灯具空调', '12类 运输工具', '13类 军火烟火', '14类 珠宝钟表', '15类-乐器', '16类 办公用品', '17类 橡胶制品', '18类 皮革皮具', '19类 建筑材料', '20类 家具', '21类 厨房洁具', '22类 绳网袋篷', '23类 纱线丝', '24类 布料床单', '25类 服装鞋帽', '26类 钮扣拉链', '27类 地毯席垫', '28类 健身器材', '29类 食品', '30类 方便食品', '31类 饲料种籽', '32类 啤酒饮料', '33类 酒', '34类 烟草烟具', '35类 广告销售', '36类 金融物管', '37类 建筑修理', '38类 通讯服务', '39类 运输贮藏', '40类 材料加工', '41类 教育娱乐', '42类 网站服务', '43类 餐饮住宿', '44类 医疗园艺', '45类 社会服务']
  },
  toDetails(e) {
    wx.navigateTo({
      url: '../trademarkDetails/trademarkDetails?type=' + e.currentTarget.dataset.type
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    console.log(options.type);
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})